Revit 2023 API
Rebar.SetHookRotationAngle Method
 Sets the out of plane hook rotation angle at the specified end.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2021
Syntax
C#
public void SetHookRotationAngle(
	double hookRotationAngle,
	int iEnd
)
Visual Basic
Public Sub SetHookRotationAngle ( _
	hookRotationAngle As Double, _
	iEnd As Integer _
)
Visual C++
public:
void SetHookRotationAngle(
	double hookRotationAngle,
	int iEnd
)
Parameters
hookRotationAngle
Type: System.Double
 The out of plane hook rotation angle at the specified end.
iEnd
Type: System.Int32
 0 for the start , 1 for the end.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  iEnd must be 0 or 1.
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace